Tekla.Structures.Drawing.CurvedSectionMark
The CurvedSectionMark class defines a drawing object that illustrates a curved section in a specific view.
In contrast to straight section mark, the curved section mark can only be inserted as a result of
creating a curved section view.
The following code modifies a curved section mark in the current drawing:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class CurvedSectionMarkExample
{
public void CurvedSectionMarkModify()
{
DrawingHandler myDrawingHandler = new DrawingHandler();
DrawingObjectSelector dos = myDrawingHandler.GetDrawingObjectSelector();
DrawingObjectEnumerator allObjectsOnSheet = dos.GetSelected();
while (allObjectsOnSheet.MoveNext())
{
if (allObjectsOnSheet.Current is Tekla.Structures.Drawing.CurvedSectionMark)
{
CurvedSectionMark sectionMark = allObjectsOnSheet.Current as Tekla.Structures.Drawing.CurvedSectionMark;
sectionMark.Attributes.LineWidthOffsetLeft = 5;
sectionMark.Attributes.LineWidthOffsetRight = 5;
sectionMark.Modify();
}
}
}
}

Tekla.Structures.Drawing.CurvedSectionMark.MiddlePoint
The middle arc point of a curved section mark.

Tekla.Structures.Drawing.CurvedSectionMark.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.